In [103]:
import pandas as pd

In [104]:

import pandas as pd

df=pd.read_csv('datas.csv')

In [105]:

df

    1 DPLM Software --- in.pune.careers@3dplmsoftware.com
0          2 Aahlaad Software --- hr.admin@aahlaad.com
1      3 Accenture --- akash.shivnarayan@accenture.com
2          4 Accenture --- aruna.b.reddy@accenture.com
3          5 Accenture --- azharuddin.md@accenture.com
4            6 Accenture --- keerthi.raj@accenture.com
..                                                 ...
744                 384 Yodlee --- bshriyan@yodlee.com
745                                                NaN
746  385 Zool Tech Solutions Pvt. Ltd --- amandeep@...
747                                                NaN
748                                                NaN

[749 rows x 1 columns]

In [106]:
df.rename(columns = {'1 DPLM Software --- in.pune.careers@3dplmsoftware.com':'TEST'}, inplace = True)

In [107]:
df=df[~df['TEST'].isna()]

In [108]:
df.size

384

In [109]:
df.head()

                                              TEST
0      2 Aahlaad Software --- hr.admin@aahlaad.com
1  3 Accenture --- akash.shivnarayan@accenture.com
2      4 Accenture --- aruna.b.reddy@accenture.com
3      5 Accenture --- azharuddin.md@accenture.com
4        6 Accenture --- keerthi.raj@accenture.com

In [110]:
df['name']=df['TEST'].str.split('---').str.get(0)

/tmp/ipykernel_3201/2816788499.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name']=df['TEST'].str.split('---').str.get(0)

In [111]:
df['email']=df['TEST'].str.split('---').str.get(1)

/tmp/ipykernel_3201/3513759880.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['email']=df['TEST'].str.split('---').str.get(1)

In [112]:
df.head()

,TEST,name,email
0,2 Aahlaad Software --- hr.admin@aahlaad.com,2 Aahlaad Software,hr.admin@aahlaad.com
1,3 Accenture --- akash.shivnarayan@accenture.com,3 Accenture,akash.shivnarayan@accenture.com
2,4 Accenture --- aruna.b.reddy@accenture.com,4 Accenture,aruna.b.reddy@accenture.com
3,5 Accenture --- azharuddin.md@accenture.com,5 Accenture,azharuddin.md@accenture.com
4,6 Accenture --- keerthi.raj@accenture.com,6 Accenture,keerthi.raj@accenture.com

In [113]:
df=df[['name','email']]

In [114]:
df

                                  name                             email
0                  2 Aahlaad Software               hr.admin@aahlaad.com
1                         3 Accenture    akash.shivnarayan@accenture.com
2                         4 Accenture        aruna.b.reddy@accenture.com
3                         5 Accenture        azharuddin.md@accenture.com
4                         6 Accenture          keerthi.raj@accenture.com
..                                 ...                               ...
738                         381 Yahoo              arunima@yahoo-inc.com
740                         382 Yahoo             kishormn@yahoo-inc.com
742                         383 Yahoo             rochelef@yahoo-inc.com
744                        384 Yodlee                bshriyan@yodlee.com
746  385 Zool Tech Solutions Pvt. Ltd                   amandeep@zool.in

[384 rows x 2 columns]

In [115]:
df['name'].str.split(' ')

0                       [2, Aahlaad, Software, ]
1                               [3, Accenture, ]
2                               [4, Accenture, ]
3                               [5, Accenture, ]
4                               [6, Accenture, ]
                         ...
738                               [381, Yahoo, ]
740                               [382, Yahoo, ]
742                               [383, Yahoo, ]
744                              [384, Yodlee, ]
746    [385, Zool, Tech, Solutions, Pvt., Ltd, ]
Name: name, Length: 384, dtype: object

In [116]:
df['name'].sample(10)

415             220 Mcafee
49               37 Amazon
646          335 TekSystem
117           71 Capgimini
463           244 NTT DATA
606    315 Symphony Teleca
423          224 Microland
592         308 Stream Net
395     210 Magna Infotech
173                 99 CSC
Name: name, dtype: object

In [119]:
df['name']=df['name'].str.split(' ').str.slice(1,6).str.join(' ')

In [121]:
df.sample(10)

                        name                         email
151               Cognizant         Manju.D2@cognizant.com
453       Ness Technologies      Mahendra.Balaram@ness.com
461                NTT DATA       guru.prakash@nttdata.com
513                Plintron       recruitment@plintron.com
3                 Accenture    azharuddin.md@accenture.com
696        Trigent Software            prema_p@trigent.com
317  Innominds Software Inc          ssaxena@innominds.com
143             Cigniti Inc        wearehiring@cigniti.com
297                I-Exceed        samuel.soy@i-exceed.com
59                   Amazon             vivekmo@amazon.com

In [124]:
# df.to_excel('best_data.xlsx')

In [126]:
df.shape

(384, 2)

In [128]:
df.reset_index(drop=True)

                             name                             email
0               Aahlaad Software               hr.admin@aahlaad.com
1                      Accenture    akash.shivnarayan@accenture.com
2                      Accenture        aruna.b.reddy@accenture.com
3                      Accenture        azharuddin.md@accenture.com
4                      Accenture          keerthi.raj@accenture.com
..                            ...                               ...
379                        Yahoo              arunima@yahoo-inc.com
380                        Yahoo             kishormn@yahoo-inc.com
381                        Yahoo             rochelef@yahoo-inc.com
382                       Yodlee                bshriyan@yodlee.com
383  Zool Tech Solutions Pvt. Ltd                  amandeep@zool.in

[384 rows x 2 columns]

In [ ]:
df.to_excel('best_data.xlsx',index=False)